app/Controllers/Animal.php

SELECT *
FROM `animales`
---
    public function index(){

        $data=[
           "animales" => $this->model->findAll()
        ];