app/Controllers/Cita.php

    public function index(){



        $usuarioModel = model('App\Models\UsuarioModel');
        $mascotaModel = model('App\Models\MascotaModel');



        $data=[
            "citas" => $this->model->getCitas(),
            "usuarios" => $usuarioModel->findAll(),
            "mascotas" => $mascotaModel->findAll(),
---
SELECT *
FROM `usuarios`
SELECT *
FROM `mascotas`

    public function showAll(){

        $data=[
           "citas" => $this->model->findAll()
        ];
---
SELECT *
FROM `citas`