app/Controllers/Mascota.php

SELECT *
FROM `usuarios`
SELECT *
FROM `animales`
---
    public function index(){

        $db = db_connect();
        $model = new MascotaModel($db);
        $result = $this->model->getMascotas();

        echo $result;

        $usuarioModel = new UsuarioModel();
        $animalModel = new AnimalModel();

        $data=[
            "mascotas" => $this->model->findAll(),
            "usuarios" => $usuarioModel->findAll(),
            "animales" => $animalModel->findAll(),

SELECT *
FROM `mascotas`
---
    public function showAll(){

        $data=[
           "mascotas" => $this->model->findAll()
        ];