app/Controllers/Producto.php

    public function index(){

        $data=[
            "productos" => $this->model->findAll(),
         ];
---
SELECT *
FROM `productos`