app/Controllers/Usuario.php

SELECT *
FROM `usuarios`
---
    public function index(){


        $data=[
            "usuarios" => $this->model->findAll()
         ];

SELECT *
FROM `usuarios`
---
    public function showAll(){

        $data=[
           "usuarios" => $this->model->findAll()
        ];