app/Controllers/Venta.php

    public function index()
    {

        $usuarioModel = model('App\Models\UsuarioModel');
        $productoModel = model('App\Models\ProductoModel');

        $data = [
            "usuarios" => $usuarioModel->findAll(),
            "productos" => $productoModel->findAll(),
            "ventas" => $this->model->findAll()
        ];
---
SELECT *
FROM `usuarios`
SELECT *
FROM `productos`
SELECT *
FROM `ventas`