app/Models/CitaModel.php

SELECT `c`.*, `m`.`nombre` as `mascota`, `u`.`nombre` as `cliente`
FROM `citas` as `c`
JOIN `mascotas` as `m` ON `c`.`idMascota` = `m`.`id`
JOIN `usuarios` as `u` ON `c`.`idUsuario` = `u`.`id`
---
    public function getCitas(){

        return  json_encode($this->db->table('citas as c')
        ->select('c.*, m.nombre as mascota, u.nombre as cliente')
        ->join('mascotas as m','c.idMascota = m.id')
        ->join('usuarios as u','c.idUsuario = u.id')
        ->get()
        ->getResult());