app/Models/MascotaModel.php

SELECT `m`.*, `a`.`nombre` as `animal`, `u`.`nombre` as `cliente`
FROM `mascotas` as `m`
JOIN `animales` as `a` ON `m`.`idAnimal` = `a`.`id`
JOIN `usuarios` as `u` ON `m`.`idUsuario` = `u`.`id`
---
    public function getMascotas(){

        return  $this->db->table('mascotas as m')
        ->select('m.*, a.nombre as animal, u.nombre as cliente')
        ->join('animales as a','m.idAnimal = a.id')
        ->join('usuarios as u','m.idUsuario = u.id')
        ->get()
        ->getResultArray();