app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `telefono` = 'lll'
AND `contrasena` = 'll'
OR `correo` = 'lll'
OR `contrasena` = 'll'
 LIMIT 1
---
    public function login($user, $password)
    {

        $result = $this->asArray()
            ->where([
                "telefono" => $user,
                "contrasena" => $password
            ])->orWhere([
                "correo" => $user,
                "contrasena" => $password
            ])->first();